snlkuharlocal/src/Documents/ЗаданиеНаСборкуКомплектовЧЗ/ЗаданиеНаСборкуКомплектовЧЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаданиеНаСборкуКомплектовЧЗ</name>
  <comment>Задание на сборку комплектов ЗЧ</comment>
  <basedOn>Document.ЗаданиеНабора</basedOn>
  <basedOn>Document.Комплектация</basedOn>
  <basedOn>Document.РасходнаяНакладная</basedOn>
  <registerRecords>InformationRegister.РезервыКМ</registerRecords>
  <registerRecords>InformationRegister.СтатусыКМ_Факт</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиДоступныхКМ</registerRecords>
  <registerRecords>InformationRegister.СтатусыКМ_Факт_А</registerRecords>
  <registerRecords>InformationRegister.ОшибкиПолученияКМ</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппыТоваров</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокОснование</name>
    <type>
      <types>DocumentRef.Комплектация</types>
      <types>DocumentRef.РасходнаяНакладная</types>
      <types>DocumentRef.Перемаркировка</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеНакладной</name>
    <type>
      <types>EnumRef.СостоянияНакладной</types>
    </type>
  </attributes>
  <attributes>
    <name>СформированыАгрегации</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаданиеНабора</name>
    <type>
      <types>DocumentRef.ЗаданиеНабора</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоШК</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоКомплектующих</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусОбработкиЧЗ</name>
    <type>
      <types>EnumRef.СтатусыДокументовМаркировки</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьМаркированыеКомплектующие</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусыАктуализированы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РабочееМесто</name>
    <type>
      <types>CatalogRef.РабочиеМеста</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Единица</name>
      <type>
        <types>CatalogRef.Единицы</types>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Комплектующие</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Единица</name>
      <type>
        <types>CatalogRef.Единицы</types>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Продукция</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ШтрихкодыУпаковок</name>
    <attributes>
      <name>ШтрихкодУпаковки</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
    <attributes>
      <name>ШтрихкодКоробки</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
    <attributes>
      <name>ЛистСборки</name>
      <type>
        <types>DocumentRef.ЛистСборкиКомплектовЧЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>Распечатан</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Нанесен</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗабронированПодСборку</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/InformationRegisters/СтатусыКМ_Факт/СтатусыКМ_Факт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатусыКМ_Факт</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыКодовМаркировкиФакт</types>
    </type>
  </resources>
  <resources>
    <name>Местонахождение</name>
    <type>
      <types>CatalogRef.Склады</types>
      <types>DocumentRef.ЗаказПоставщику</types>
      <types>CatalogRef.Подразделения</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </resources>
  <resources>
    <name>ВПути</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипШК</name>
    <type>
      <types>EnumRef.ТипыШтрихКодов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ШтрихКодУпаковки</name>
    <type>
      <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/InformationRegisters/РезервыКМ/РезервыКМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РезервыКМ</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Использован</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>Накладная</name>
    <type>
      <types>String</types>
      <types>DocumentRef.РасходнаяНакладная</types>
      <types>DocumentRef.Перемещение</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРезервирования</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛистНабора</name>
    <type>
      <types>DocumentRef.ЛистПереукладки</types>
      <types>DocumentRef.ЛистНабора</types>
    </type>
  </attributes>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ШтрихКодУпаковки</name>
    <type>
      <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипШК</name>
    <type>
      <types>EnumRef.ТипыШтрихКодов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/Enums/ТипУзлаИБ/ТипУзлаИБ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипУзлаИБ</name>
  <enumValues>
    <name>ИнтегральнаяИБ</name>
  </enumValues>
  <enumValues>
    <name>УправляющееПодразделение</name>
  </enumValues>
  <enumValues>
    <name>Склад</name>
  </enumValues>
  <enumValues>
    <name>ТорговоеПодразделение</name>
  </enumValues>
  <enumValues>
    <name>Филиал</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/СтатусыДокументовМаркировки/СтатусыДокументовМаркировки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыДокументовМаркировки</name>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеОтложеннойОбработки</name>
  </enumValues>
  <enumValues>
    <name>КОбработке</name>
  </enumValues>
  <enumValues>
    <name>Обрабатывается</name>
  </enumValues>
  <enumValues>
    <name>ОшибкаОбработки</name>
  </enumValues>
  <enumValues>
    <name>ОбработанЧЗ</name>
  </enumValues>
  <enumValues>
    <name>ОшибкаОбработкиЧЗ</name>
  </enumValues>
  <enumValues>
    <name>Обработан</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/ВидыОперацийМаркировки/ВидыОперацийМаркировки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОперацийМаркировки</name>
  <enumValues>
    <name>Агрегация</name>
  </enumValues>
  <enumValues>
    <name>АТК</name>
  </enumValues>
  <enumValues>
    <name>БронированиеАгрегационныхКодов</name>
  </enumValues>
  <enumValues>
    <name>ВводВОборот</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборота</name>
  </enumValues>
  <enumValues>
    <name>Списание</name>
  </enumValues>
  <enumValues>
    <name>РасформированиеУпаковки</name>
  </enumValues>
  <enumValues>
    <name>ВозвратВОборот</name>
  </enumValues>
  <enumValues>
    <name>ОтгрузкаВЕАЭС</name>
  </enumValues>
  <enumValues>
    <name>ФормированиеНабора</name>
  </enumValues>
  <enumValues>
    <name>Перемаркировка</name>
  </enumValues>
  <enumValues>
    <name>ТрансформацияУпаковки</name>
    <comment>Трансформация упаковки (Добавление, Изъятие)</comment>
  </enumValues>
  <enumValues>
    <name>ТрансформацияАТК</name>
    <comment>Трансформация АТК (Добавление, Изъятие)</comment>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/ВидыКомплектов/ВидыКомплектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыКомплектов</name>
  <enumValues>
    <name>Комплект</name>
  </enumValues>
  <enumValues>
    <name>Ассортито</name>
  </enumValues>
  <enumValues>
    <name>Товар</name>
  </enumValues>
  <enumValues>
    <name>ГотовыйКомплект</name>
  </enumValues>
  <enumValues>
    <name>АссортитоКомплектов</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/СтатусыКодовМаркировкиФакт/СтатусыКодовМаркировкиФакт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыКодовМаркировкиФакт</name>
  <enumValues>
    <name>Эмитирован</name>
  </enumValues>
  <enumValues>
    <name>ПереданПоставщику</name>
  </enumValues>
  <enumValues>
    <name>ГотовКПечати</name>
  </enumValues>
  <enumValues>
    <name>Распечатан</name>
  </enumValues>
  <enumValues>
    <name>Нанесен</name>
  </enumValues>
  <enumValues>
    <name>НанесенВиртуально</name>
  </enumValues>
  <enumValues>
    <name>Вложен</name>
  </enumValues>
  <enumValues>
    <name>ОтгруженПоставщиком</name>
  </enumValues>
  <enumValues>
    <name>ВОбороте</name>
  </enumValues>
  <enumValues>
    <name>Карантин</name>
  </enumValues>
  <enumValues>
    <name>Списан</name>
  </enumValues>
  <enumValues>
    <name>ВозвращенПоставщику</name>
  </enumValues>
  <enumValues>
    <name>ОтгруженПокупателю</name>
  </enumValues>
  <enumValues>
    <name>ЗакупленВРФ</name>
  </enumValues>
  <enumValues>
    <name>Выбыл</name>
  </enumValues>
  <enumValues>
    <name>Зарезервирован</name>
  </enumValues>
  <enumValues>
    <name>Расформирован</name>
  </enumValues>
  <enumValues>
    <name>ВнутренняяАгрегация</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/ТипыКодовМаркировки/ТипыКодовМаркировки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыКодовМаркировки</name>
  <enumValues>
    <name>Товар</name>
  </enumValues>
  <enumValues>
    <name>Набор</name>
  </enumValues>
  <enumValues>
    <name>ЛогистическаяУпаковка</name>
  </enumValues>
  <enumValues>
    <name>АТК</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/СостоянияНакладной/СостоянияНакладной.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияНакладной</name>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>КОтправкеНаСклад</name>
    <comment>Накладная готова к отправке на склад</comment>
  </enumValues>
  <enumValues>
    <name>ПолученоСкладом</name>
  </enumValues>
  <enumValues>
    <name>ВНаборе</name>
  </enumValues>
  <enumValues>
    <name>Сканирование</name>
  </enumValues>
  <enumValues>
    <name>ГотоваКОтгрузке</name>
  </enumValues>
  <enumValues>
    <name>Отгружена</name>
  </enumValues>
  <enumValues>
    <name>Принята</name>
    <comment>Накладная оприходована складом</comment>
  </enumValues>
  <enumValues>
    <name>ГотоваКПриемке</name>
  </enumValues>
  <enumValues>
    <name>КОтправкеВОфис</name>
  </enumValues>
  <enumValues>
    <name>ПолученоОфисом</name>
  </enumValues>
  <enumValues>
    <name>Доставлена</name>
  </enumValues>
  <enumValues>
    <name>ПринятаНаТранзитныйСклад</name>
    <comment>Накладная приянта на транзитный склад</comment>
  </enumValues>
  <enumValues>
    <name>ОтгруженаНаТранзитныйСклад</name>
    <comment>Накладная приянта на транзитный склад</comment>
  </enumValues>
  <enumValues>
    <name>РезервУпаковки</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеОплаты</name>
  </enumValues>
  <enumValues>
    <name>ДопОбработка</name>
  </enumValues>
  <enumValues>
    <name>ДоставленаНаСклад</name>
  </enumValues>
  <enumValues>
    <name>ВМашине</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеНабора</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеСканирования</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеДопОбработки</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеПереукладки</name>
  </enumValues>
  <enumValues>
    <name>Переукладка</name>
  </enumValues>
  <enumValues>
    <name>ВЗонеХранения</name>
  </enumValues>
  <enumValues>
    <name>ПроверенаПоОстаткам</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеПаллетирования</name>
  </enumValues>
  <enumValues>
    <name>Паллетирование</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеТермоусадки</name>
  </enumValues>
  <enumValues>
    <name>Термоусадка</name>
  </enumValues>
  <enumValues>
    <name>СформированыЗаданияНабора</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеКорректировки</name>
  </enumValues>
  <enumValues>
    <name>Отменена</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеКомплектацииЧЗ</name>
  </enumValues>
  <enumValues>
    <name>КомплектацияЧЗ</name>
  </enumValues>
  <enumValues>
    <name>ЗаказКМЧЗ</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеОбработкиЧЗ</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Documents/ЗаданиеНаСборкуКомплектовЧЗ/ManagerModule.bsl
#Область СозданиеДокументов

Функция Создать_ЗаданиеНаМаркировку(ДокОснование_ссылка) Экспорт
	
	Запрос=новый запрос;
	запрос.Текст=  "ВЫБРАТЬ
	|	ЗаданиеНаМаркировку.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ЗаданиеНаМаркировку КАК ЗаданиеНаМаркировку
	|ГДЕ
	|	ЗаданиеНаМаркировку.ДокОснование = &ДокОснование_ссылка" ;
	запрос.УстановитьПараметр("ДокОснование_ссылка",ДокОснование_ссылка);
	Выборка=запрос.Выполнить().Выбрать();
	ЗНМОбъект=Неопределено;
	пока Выборка.Следующий() цикл
		ЗНМОбъект=выборка.ссылка.получитьобъект();
		ЗНМОбъект.ПометкаУдаления=Ложь;
		ЗНМОбъект.Товары.Очистить();
		
	КонецЦикла;
	если ЗНМОбъект=Неопределено тогда
		ЗНМОбъект=Документы.ЗаданиеНаМаркировку.СоздатьДокумент();
	КонецЕсли;
	
	
	ЗНМОбъект.Автор=ПараметрыСеанса.Пользователь;
	
	
	
	//Кухарь 05.09.2024 начало	
	если ПараметрыСеанса.ТипУзла = Перечисления.ТипУзлаИБ.Склад тогда
		Запрос.Текст="ВЫБРАТЬ
		|	ЗаданиеНабораТовары.Номенклатура КАК Номенклатура,
		|	СУММА(ЗаданиеНабораТовары.Количество) КАК Количество,
		|	ЗаданиеНабораТовары.Номенклатура.ОсновнаяЕдиница КАК Единица,
		|	ЗаданиеНабораТовары.Номенклатура.Коэффициент КАК Коэффициент
		|ИЗ
		|	Документ.ЗаданиеНабора.Товары КАК ЗаданиеНабораТовары
		|ГДЕ
		|	ЗаданиеНабораТовары.Ссылка.ТребуетсяМаркировка
		|	И ЗаданиеНабораТовары.Ссылка.Накладная = &ДокОснование_ссылка
		|	И ЗаданиеНабораТовары.Ссылка.Проведен
		|	И ЗаданиеНабораТовары.Ссылка.Дата >= &Дата
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаданиеНабораТовары.Номенклатура";
		запрос.УстановитьПараметр("Дата",Константы.ДатаЗапретаРедактирования.Получить());
	иначе
		Запрос.Текст="ВЫБРАТЬ
		|	РасходнаяНакладнаяТовары.Номенклатура КАК Номенклатура,
		|	РасходнаяНакладнаяТовары.Количество КАК Количество,
		|	РасходнаяНакладнаяТовары.Единица КАК Единица,
		|	РасходнаяНакладнаяТовары.Коэффициент КАК Коэффициент
		|ИЗ
		|	Документ.РасходнаяНакладная.Товары КАК РасходнаяНакладнаяТовары
		|ГДЕ
		|	РасходнаяНакладнаяТовары.Ссылка = &Ссылка
		|	И РасходнаяНакладнаяТовары.Количество > 0
		|	И РасходнаяНакладнаяТовары.Номенклатура.Родитель.ТНВЭД.ДатаНачалаОбязательнойРаботыСМаркировкой <> &ПустаяДата
		|	И РасходнаяНакладнаяТовары.Номенклатура.Родитель.ТНВЭД.ДатаНачалаОбязательнойРаботыСМаркировкой < РасходнаяНакладнаяТовары.Ссылка.ДатаОтгрузки";
		запрос.УстановитьПараметр("Ссылка",ДокОснование_ссылка);
		запрос.УстановитьПараметр("ПустаяДата",ПустаяДата());
	КонецЕсли;
	//Кухарь 05.09.20204 начало	

	ЗНМОбъект.Товары.Загрузить(запрос.Выполнить().Выгрузить());
	ЗНМОбъект.Дата=ТекущаяДатаСеанса();
	ЗНМОбъект.ДокОснование=ДокОснование_ссылка;
	ЗНМОбъект.Записать(РежимЗаписиДокумента.Проведение);
	Возврат ЗНМОбъект.Ссылка;
	
	
КонецФункции //Создать_ЗаданиеНаМаркировку(ЗаданиеНабора_Ссылка) Экспорт

Функция Создать_Агрегации(ЗаданиеНаМаркировку_Ссылка, ДопПараметры = Неопределено) Экспорт
	Результат = МаркировкаКС.СтруктураРезультата();	
	
	рСоздания = НайтиСоздатьДокАгрегации(ЗаданиеНаМаркировку_Ссылка);
	Если рСоздания.Успешно Тогда
		ДокОбъект = рСоздания.Данные;	
		
		ДокОбъект.Заполнить(ЗаданиеНаМаркировку_Ссылка);
		
		ДокОбъект.Статус = МаркировкаКС.ПолучитьЗначениеПараметра(ДопПараметры, "Статус", Перечисления.СтатусыДокументовМаркировки.ВРаботе);
				
		ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);	
		
		Результат.Данные = ДокОбъект.Ссылка;
		Результат.ОбработаноОбъектов = 1;		
	Иначе
		МаркировкаКС.ДобавитьОшибки(Результат, рСоздания);	
	КонецЕсли;
	
	Результат.Успешно = (Результат.Ошибки.Количество() = 0);
	
	Возврат Результат;	
КонецФункции //Создать_Агрегации()

Функция НайтиСоздатьДокАгрегации(ДокументОснование,ВидОперацииМаркировки = неопределено) //Данилова Е.В. 18.08.2025 MARK-1756
	Результат = МаркировкаКС.СтруктураРезультата();
	//++Данилова Е.В. 18.08.2025 MARK-1756
	Если ВидОперацииМаркировки = неопределено Тогда
	
		ВидОперацииМаркировки = Перечисления.ВидыОперацийМаркировки.ФормированиеНабора; 	
	
	КонецЕсли;
	//--Данилова Е.В. 18.08.2025
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	МаркировкаТоваровИСМП.Ссылка КАК Ссылка,
	               |	МаркировкаТоваровИСМП.Статус КАК Статус
	               |ИЗ
	               |	Документ.МаркировкаТоваровИСМП КАК МаркировкаТоваровИСМП
	               |ГДЕ
	               |	МаркировкаТоваровИСМП.ДокументОснование = &ДокументОснование
				   //++Данилова Е.В. 18.08.2025 MARK-1756
	               |	И МаркировкаТоваровИСМП.ВидОперации = &ВидОперации
				   //--Данилова Е.В. 18.08.2025
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	МаркировкаТоваровИСМП.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование); 
	//++Данилова Е.В. 18.08.2025 MARK-1756
	Запрос.УстановитьПараметр("ВидОперации", ВидОперацииМаркировки); 
	//--Данилова Е.В. 18.08.2025

	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.Ссылка) Тогда
		Если Выборка.Статус<>Перечисления.СтатусыДокументовМаркировки.ВРаботе Тогда
			ТекстОшибки = СтрШаблон("Недопустимый статус существующего документа маркировки ! %1, статус: %2 !", Выборка.Ссылка, Выборка.Статус);
					
			Результат.Успешно = Ложь;
			Результат.Ошибки.Добавить(ТекстОшибки);
		Иначе
			ДокОбъект = Выборка.Ссылка.ПолучитьОбъект();
		КонецЕсли;
	Иначе
		ДокОбъект = Документы.МаркировкаТоваровИСМП.СоздатьДокумент();		
	КонецЕсли;
	
	Результат.Данные = ДокОбъект;
	Возврат Результат;
КонецФункции //НайтиСоздатьДокАгрегации(ДокументОснование)
 
// Кухарь А.Ю. 17.01.2025 начало
//
// Кельманов А.В. - HELP-4265 - 2025.04.17 {
//Функция НайтиСоздатьДокНаРезервированиеКомплектовПодОтгрузку (ДокОснование_ссылка,Перезаполнять=Истина) экспорт
Функция НайтиСоздатьДокНаРезервированиеКомплектовПодОтгрузку (ДокОснование_ссылка, Перезаполнять = Истина, СоздаватьНовыйЕслиПомеченНаУдаление = Ложь) Экспорт
// Кельманов А.В. - HELP-4265 - 2025.04.17 }
	СтруктураОтвета=новый Структура("Успех,Ошибки,Ссылка",Истина,"");
	МассивОшибок=новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ первые 1
	|	ЗаданиеНаСборкуКомплектовЧЗ.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ЗаданиеНаСборкуКомплектовЧЗ КАК ЗаданиеНаСборкуКомплектовЧЗ
	|ГДЕ
	|	ЗаданиеНаСборкуКомплектовЧЗ.ДокОснование = &ДокОснование_ссылка";

	// Кельманов А.В. - HELP-4265 - 2025.04.17 {
	// Кельманов А.В. - MARK-2511 - 2025.07.01 {
	//Если СоздаватьНовыйЕслиПомеченНаУдаление Тогда
	Если СоздаватьНовыйЕслиПомеченНаУдаление И ДокОснование_ссылка.Дата < '20250702' Тогда
	// Кельманов А.В. - MARK-2511 - 2025.07.01 }
		
		Запрос.Текст = Запрос.Текст + "
		|	И ЗаданиеНаСборкуКомплектовЧЗ.Проведен"; 
		
	КонецЕсли;
	// Кельманов А.В. - HELP-4265 - 2025.04.17 }
	
	Запрос.УстановитьПараметр("ДокОснование_ссылка",ДокОснование_ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	ДокументЗСБ_Объект=Неопределено;
	пока Выборка.Следующий() цикл
		если не Перезаполнять тогда
			СтруктураОтвета.Ссылка= Выборка.ссылка;
			возврат СтруктураОтвета;
		иначе
			
			ДокументЗСБ_Объект=Выборка.ссылка.ПолучитьОбъект();
			ДокументЗСБ_Объект.ПометкаУдаления=Ложь;
			ДокументЗСБ_Объект.Товары.Очистить();
			ДокументЗСБ_Объект.Комплектующие.Очистить();
			
			ДокументЗСБ_Объект.Дата = ТекущаяДата(); // Кельманов А.В. - Оптимизация работы - 2025.08.06
			
			// Кельманов А.В. - Оптимизация работы - 2025.04.17 {
			ДокументЗСБ_Объект.ЗаполнитьТЧПоОснованию();
			// Кельманов А.В. - Оптимизация работы - 2025.04.17 }
			
			ДокументЗСБ_Объект.ШтрихкодыУпаковок.Очистить();
			ДокументЗСБ_Объект.Записать(РежимЗаписиДокумента.Проведение);
			
			// Кухарь А.Ю.  15.05.2025 начало
			РегистрыСведений.СтатусыКМ_Факт.ОчиститьДвижения(Выборка.ссылка); 
			// Кухарь А.Ю.  15.05.2025 конец
			
			
		КонецЕсли;	
	КонецЦикла;
	
	если не Перезаполнять тогда
		СтруктураОтвета.Успех= ложь;
		СтруктураОтвета.Ошибки= "Не найден ЗСБ.";	
		Возврат СтруктураОтвета;
	КонецЕсли;
	
	
	если ДокументЗСБ_Объект = Неопределено тогда
		ДокументЗСБ_Объект=Документы.ЗаданиеНаСборкуКомплектовЧЗ.СоздатьДокумент();
		//+++Чирков		
		//ДокументЗСБ_Объект.ОбработкаЗаполнения(ДокОснование_ссылка,"",Истина);
		
		//Есть нормальный штатный метод - называется "Заполнить" - делает ровно тоже самое
		ДокументЗСБ_Объект.Заполнить(ДокОснование_ссылка);
		
		//Организация и так заполняется по основанию (А еще есть БТС)
		//ДокументЗСБ_Объект.Организация=Маркировка_ПИ.ОрганизацияЕЕЭ();
		
		//Перенесено в обработку заполнения
		//А вообще 100500 раз говорил - пропишите нормально подразделения в пользователях или поправьте один раз функцию получения подразделеения по умолчанию при заполнении шапки
		//ДокументЗСБ_Объект.Подразделение=ОбщегоНазначения_ПИ.ПолучитьПодразделениеТекущегоУзла(); 
		//---Чирков
		ДокументЗСБ_Объект.Записать();
		
	КонецЕсли;

	Возврат ЗаполнитьКодыЧЗВЗСБ(ДокументЗСБ_Объект, ДокОснование_ссылка); // Кельманов А.В. - HELP-5258 - 2025.05.29
	
	ТаблицаПереопределяемыхДат=МаркировкаКС.ПодготовитьТаблицуСПереопределяемойДатойНачалаРаботыСМаркировкой(ДокОснование_ссылка,"Товары");	
	
	Запрос=новый запрос;
	Запрос.Текст="ВЫБРАТЬ
	|	ТЗ.Номенклатура КАК Номенклатура,
	|	ТЗ.ДатаНачалаРаботыСМаркировкой КАК ДатаНачалаРаботыСМаркировкой
	|ПОМЕСТИТЬ ТЗ_ДатМаркировки
	|ИЗ
	|	&ТаблицаПереопределяемыхДат КАК ТЗ
	|ГДЕ
	|	ТЗ.ДатаНачалаРаботыСМаркировкой <= &ДатаПроверки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РасходнаяНакладнаяТовары.Номенклатура КАК Номенклатура,
	|	РасходнаяНакладнаяТовары.Количество КАК Количество
	|ПОМЕСТИТЬ ТЧ_Накладной
	|ИЗ
	|	Документ.РасходнаяНакладная.Товары КАК РасходнаяНакладнаяТовары
	|ГДЕ
	|	РасходнаяНакладнаяТовары.Ссылка = &ДокОснование_ссылка
	|	И РасходнаяНакладнаяТовары.Номенклатура.Родитель.ВидКомплекта = &Комплект
	|	И РасходнаяНакладнаяТовары.Количество > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТЧ_Накладной.Номенклатура КАК Номенклатура,
	|	ТЧ_Накладной.Количество КАК Количество
	|ИЗ
	|	ТЗ_ДатМаркировки КАК ТЗ_ДатМаркировки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТЧ_Накладной КАК ТЧ_Накладной
	|		ПО ТЗ_ДатМаркировки.Номенклатура = ТЧ_Накладной.Номенклатура";
	запрос.УстановитьПараметр("ТаблицаПереопределяемыхДат",ТаблицаПереопределяемыхДат);
	запрос.УстановитьПараметр("Комплект",Перечисления.ВидыКомплектов.Комплект);
	запрос.УстановитьПараметр("ДокОснование_ссылка",ДокОснование_ссылка);
	
	запрос.УстановитьПараметр("ДатаПроверки",ПолучитьРеквизитШапки(ДокОснование_ссылка,"ДатаОтгрузки","Документ"));
	
	Выборка=запрос.Выполнить().Выбрать();
	
	   
	// Кухарь А.Ю.  29.03.2025 начало
	МассивНоменклатуры=новый Массив;
	пока Выборка.Следующий() цикл
		для сч=1 по Выборка.Количество цикл
			МассивНоменклатуры.Добавить(Выборка.Номенклатура);
		КонецЦикла;
	КонецЦикла;
	
	Выборка.Сбросить();
	
	ДопПараметры=новый Структура("НовыйСтатус,ТипКода,Добавлять"
	,Перечисления.СтатусыКодовМаркировкиФакт.Зарезервирован,Перечисления.ТипыКодовМаркировки.Набор,Истина);
	
	РезультатПолученияКодов=Справочники.ШтрихкодыУпаковокТоваров.ПолучитьЗабронироватьСвободныеКодыШтук(МассивНоменклатуры,ДокументЗСБ_Объект.Ссылка,ДопПараметры);		
	если не РезультатПолученияКодов.Успешно тогда
		Сообщить(СтрСоединить(РезультатПолученияКодов.Ошибки,символы.ПС));
		СтруктураОтвета.Успех=ложь;
		возврат СтруктураОтвета;
	иначе
		пока Выборка.Следующий() цикл		
			Для каждого СтрокаДанных из РезультатПолученияКодов.Данные.получить(Выборка.Номенклатура) цикл
				СтрТЧ=ДокументЗСБ_Объект.ШтрихкодыУпаковок.Добавить();
				СтрТЧ.ШтрихкодУпаковки=СтрокаДанных;
				СтрТЧ.ЗабронированПодСборку = Истина;
			КонецЦикла;
		КонецЦикла;	
	КонецЕсли;	
	
	ДокументЗСБ_Объект.Проведен=Истина;
	ДокументЗСБ_Объект.Записать();
	
	// Кухарь А.Ю. 20.10.2025 начало 
	//HELP-7517
	СтруктураОтвета.Ссылка = ДокументЗСБ_Объект.Ссылка;
	// Кухарь А.Ю. 20.10.2025 конец
	
	СтруктураОтвета.Ошибки=СтрСоединить(РезультатПолученияКодов.Ошибки,Символы.ПС);
	возврат СтруктураОтвета;
	
КонецФункции
// Кухарь А.Ю. 17.01.2025 конец

// Кельманов А.В. - HELP-5258 - 2025.05.29
Функция ЗаполнитьКодыЧЗВЗСБ(ДокументЗСБ_Объект, ДокОснование_ссылка) Экспорт

	СтруктураОтвета=новый Структура("Успех,Ошибки,Ссылка",Истина,"");
	
	ТаблицаПереопределяемыхДат=МаркировкаКС.ПодготовитьТаблицуСПереопределяемойДатойНачалаРаботыСМаркировкой(ДокОснование_ссылка,"Товары");	
	
	Запрос=новый запрос;
	Запрос.Текст="ВЫБРАТЬ
	             |	ТЗ.Номенклатура КАК Номенклатура,
	             |	ТЗ.ДатаНачалаРаботыСМаркировкой КАК ДатаНачалаРаботыСМаркировкой
	             |ПОМЕСТИТЬ ТЗ_ДатМаркировки
	             |ИЗ
	             |	&ТаблицаПереопределяемыхДат КАК ТЗ
	             |ГДЕ
	             |	ТЗ.ДатаНачалаРаботыСМаркировкой <= &ДатаПроверки
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ
	             |	ЛистСборкиКомплектовЧЗШтрихкодыУпаковок.ШтрихкодКомплекта.Владелец КАК Продукция,
	             |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЛистСборкиКомплектовЧЗШтрихкодыУпаковок.ШтрихкодКомплекта) КАК КоличествоВЛСК
	             |ПОМЕСТИТЬ ВТ_НоменклатураВЛСК
	             |ИЗ
	             |	Документ.ЛистСборкиКомплектовЧЗ.ШтрихкодыУпаковок КАК ЛистСборкиКомплектовЧЗШтрихкодыУпаковок
	             |ГДЕ
	             |	ЛистСборкиКомплектовЧЗШтрихкодыУпаковок.Ссылка.ДокОснование = &ЗСБ
	             |	И ЛистСборкиКомплектовЧЗШтрихкодыУпаковок.Ссылка.Проведен
	             |	И НЕ ЛистСборкиКомплектовЧЗШтрихкодыУпаковок.ШтрихкодКомплекта.ВерсияДанных ЕСТЬ NULL
	             |
	             |СГРУППИРОВАТЬ ПО
	             |	ЛистСборкиКомплектовЧЗШтрихкодыУпаковок.ШтрихкодКомплекта.Владелец
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ
	             |	РасходнаяНакладнаяТовары.Номенклатура КАК Номенклатура,
	             |	РасходнаяНакладнаяТовары.Количество - ЕСТЬNULL(ВТ_НоменклатураВЛСК.КоличествоВЛСК, 0) КАК Количество
	             |ПОМЕСТИТЬ ТЧ_Накладной
	             |ИЗ
	             |	Документ.РасходнаяНакладная.Товары КАК РасходнаяНакладнаяТовары
	             |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_НоменклатураВЛСК КАК ВТ_НоменклатураВЛСК
	             |		ПО РасходнаяНакладнаяТовары.Номенклатура = ВТ_НоменклатураВЛСК.Продукция
	             |ГДЕ
	             |	РасходнаяНакладнаяТовары.Ссылка = &ДокОснование_ссылка
	             |	И РасходнаяНакладнаяТовары.Номенклатура.Родитель.ВидКомплекта = &Комплект
	             |	И РасходнаяНакладнаяТовары.Количество - ЕСТЬNULL(ВТ_НоменклатураВЛСК.КоличествоВЛСК, 0) > 0
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ
	             |	ТЧ_Накладной.Номенклатура КАК Номенклатура,
	             |	ТЧ_Накладной.Количество КАК Количество
	             |ИЗ
	             |	ТЗ_ДатМаркировки КАК ТЗ_ДатМаркировки
	             |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТЧ_Накладной КАК ТЧ_Накладной
	             |		ПО ТЗ_ДатМаркировки.Номенклатура = ТЧ_Накладной.Номенклатура";
	запрос.УстановитьПараметр("ТаблицаПереопределяемыхДат",ТаблицаПереопределяемыхДат);
	запрос.УстановитьПараметр("Комплект",Перечисления.ВидыКомплектов.Комплект);
	запрос.УстановитьПараметр("ДокОснование_ссылка",ДокОснование_ссылка);
	запрос.УстановитьПараметр("ЗСБ",ДокументЗСБ_Объект.Ссылка);
	
	// Кельманов А.В. - HELP-4849 - 2026.04.28 {
	//запрос.УстановитьПараметр("ДатаПроверки",ПолучитьРеквизитШапки(ДокОснование_ссылка,"ДатаОтгрузки","Документ"));
	Если ТипЗнч(ДокОснование_ссылка) = Тип("ДокументСсылка.Комплектация") Тогда
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "РасходнаяНакладная", "Комплектация");
		
		Запрос.УстановитьПараметр("ДатаПроверки", ПолучитьРеквизитШапки(ДокОснование_ссылка, "Дата", "Документ"));
		
	Иначе
		
		Запрос.УстановитьПараметр("ДатаПроверки", ПолучитьРеквизитШапки(ДокОснование_ссылка, "ДатаОтгрузки", "Документ"));
		
	КонецЕсли;
	// Кельманов А.В. - HELP-4849 - 2026.04.28 }
	
	Выборка=запрос.Выполнить().Выбрать();
	
	   
	// Кухарь А.Ю.  29.03.2025 начало
	МассивНоменклатуры=новый Массив;
	пока Выборка.Следующий() цикл
		для сч=1 по Выборка.Количество цикл
			МассивНоменклатуры.Добавить(Выборка.Номенклатура);
		КонецЦикла;
	КонецЦикла;
	
	Выборка.Сбросить();
	
	ДопПараметры=новый Структура("НовыйСтатус,ТипКода,Добавлять"
	,Перечисления.СтатусыКодовМаркировкиФакт.Зарезервирован,Перечисления.ТипыКодовМаркировки.Набор,Истина);
	
	РезультатПолученияКодов=Справочники.ШтрихкодыУпаковокТоваров.ПолучитьЗабронироватьСвободныеКодыШтук(МассивНоменклатуры,ДокументЗСБ_Объект.Ссылка,ДопПараметры);		
	если не РезультатПолученияКодов.Успешно тогда
		Сообщить(СтрСоединить(РезультатПолученияКодов.Ошибки,символы.ПС));
		СтруктураОтвета.Успех=ложь;
		возврат СтруктураОтвета;
	иначе
		пока Выборка.Следующий() цикл		
			Для каждого СтрокаДанных из РезультатПолученияКодов.Данные.получить(Выборка.Номенклатура) цикл
				СтрТЧ=ДокументЗСБ_Объект.ШтрихкодыУпаковок.Добавить();
				СтрТЧ.ШтрихкодУпаковки=СтрокаДанных;
				СтрТЧ.ЗабронированПодСборку = Истина;
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;	
	
	ДокументЗСБ_Объект.Проведен=Истина;
	ДокументЗСБ_Объект.Записать();
	
	// Кухарь А.Ю. 20.10.2025 начало 
	//HELP-7517
	СтруктураОтвета.Ссылка = ДокументЗСБ_Объект.Ссылка;
	// Кухарь А.Ю. 20.10.2025 конец
	
	СтруктураОтвета.Ошибки=СтрСоединить(РезультатПолученияКодов.Ошибки,Символы.ПС);
	возврат СтруктураОтвета;
	
КонецФункции

#КонецОбласти

Функция ПроверитьОбновитьСостояние(ЗаданиеНаСборку) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(Различные Ссылка) КАК КолЛистовСборки
	|ИЗ
	|	Документ.ЛистСборкиКомплектовЧЗ.Товары
	|ГДЕ
	|	Ссылка.ДокОснование = &ЗаданиеНаСборку
	|;
	|ВЫБРАТЬ
	|	Номенклатура,
	|	СУММА(КолПлан) КАК КолПлан,
	|	СУММА(КолФакт) КАК КолФакт
	|ИЗ
	|(
	|	ВЫБРАТЬ
	|		Номенклатура,
	|		Количество*Коэффициент	КАК КолПлан,
	|		0						КАК КолФакт
	|	ИЗ
	|		Документ.ЗаданиеНаСборкуКомплектовЧЗ.Товары
	|	ГДЕ
	|		Ссылка = &ЗаданиеНаСборку	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	ВЫБРАТЬ
	|		Номенклатура,
	|		0						КАК КолПлан,
	|		Количество*Коэффициент	КАК КолФакт
	|	ИЗ
	|		Документ.ЛистСборкиКомплектовЧЗ.Товары
	|	ГДЕ
	|		Ссылка.ДокОснование = &ЗаданиеНаСборку
	|		И Ссылка.Завершен
	|) КАК Сводный
	|СГРУППИРОВАТЬ ПО
	|	Номенклатура
	|ИМЕЮЩИЕ
	|	СУММА(КолПлан) <> СУММА(КолФакт)
	|";
	
	Запрос.УстановитьПараметр("ЗаданиеНаСборку", ЗаданиеНаСборку);	
	
	рЗапроса = Запрос.ВыполнитьПакет();
	
	Выборка 		= рЗапроса[0].Выбрать();
	СборкаНачата	= (Выборка.Следующий() И ЗначениеЗаполнено(Выборка.КолЛистовСборки)); 	
	
	Завершен		= (рЗапроса[1].Выбрать().Количество() = 0);
	
	ТекСостояние	= ПолучитьРеквизитШапки(ЗаданиеНаСборку, "СостояниеНакладной");
	НовСостояние	= ТекСостояние;	
	Если Завершен Тогда
		Если ТекСостояние<>Перечисления.СостоянияНакладной.ГотоваКОтгрузке Тогда
			НовСостояние = Перечисления.СостоянияНакладной.ГотоваКОтгрузке;
		КонецЕсли; 			
	Иначе
		Если СборкаНачата Тогда
			Если ТекСостояние <> Перечисления.СостоянияНакладной.Сканирование Тогда
				НовСостояние = Перечисления.СостоянияНакладной.Сканирование;			
			КонецЕсли;		
		КонецЕсли;
	КонецЕсли;
	
	Если ТекСостояние <> НовСостояние Тогда
		УстановитьРеквизитШапки(ЗаданиеНаСборку, "СостояниеНакладной", НовСостояние);	
	КонецЕсли; 
	
КонецФункции

Функция ЗавершитьЗадание(ЗаданиеНаСборку) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Ссылка КАК ЛистСборки,
	|	Истина КАК Распечатан,
	|	Истина КАК Нанесен,
	|	ШтрихкодКомплекта КАК ШтрихкодУпаковки	
	|ИЗ
	|	Документ.ЛистСборкиКомплектовЧЗ.ШтрихкодыУпаковок
	|ГДЕ
	|	Ссылка.ДокОснование = &ЗаданиеНаСборку	
	|	И Ссылка.Проведен И Ссылка.Завершен
	|";
	
	Запрос.УстановитьПараметр("ЗаданиеНаСборку", ЗаданиеНаСборку);	
	
	ДокОбъект = ЗаданиеНаСборку.ПолучитьОбъект();
	Если 1=2 Тогда	
		ДокОбъект = Документы.ЗаданиеНаСборкуКомплектовЧЗ.СоздатьДокумент();		
	КонецЕсли; 
	
	ШтрихКодыУпаковок = Запрос.Выполнить().Выгрузить();
	ДокОбъект.ШтрихкодыУпаковок.Очистить();
	ДокОбъект.ШтрихкодыУпаковок.Загрузить(ШтрихКодыУпаковок);	
	ДокОбъект.СостояниеНакладной = Перечисления.СостоянияНакладной.ГотоваКОтгрузке;
	
	// Кельманов А.В. - Оптимизация работы - 2025.07.10 {
	РегистрыСведений.СтатусыКМ_Факт.ОчиститьДвижения(ДокОбъект.Ссылка);
	// Кельманов А.В. - Оптимизация работы - 2025.07.10 }

	ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
	
	//Чирков пока непонятно - юедт это использоваться или нет
	//Документы.ХранилищеКодовМаркировки.Создать_ХКМ_к_ЗСБ(ЗаданиеНаСборку);
	//++Данилова Е.В. 20.05.2026 MARK-3615 
	Если ТипЗнч(ЗаданиеНаСборку.ДокОснование) = Тип("ДокументСсылка.Перемаркировка") Тогда
		Документы.Перемаркировка.ЗавершитьПеремаркировку(ЗаданиеНаСборку.ДокОснование);
	КонецЕсли;
	//--Данилова Е.В. 20.05.2026
	
	// Кухарь А.Ю.  26.02.2026 начало
	//ШтрихКодыУпаковок.Свернуть("ЛистСборки");
	//Для Каждого Строка Из ШтрихКодыУпаковок Цикл
	//	Если ЗначениеЗаполнено(Строка.ЛистСборки) Тогда
	//		Попытка
	//			Документы.ЗаданиеНабора.КонтрольНачалаИЗавершенияКомплектацииНаборовЧЗЗНБ(ЗаданиеНаСборку, Строка.ЛистСборки);
	//		Исключение
	//			ЗаписьЖурналаРегистрации("Отладка", УровеньЖурналаРегистрации.Предупреждение, Метаданные.Документы.ЗаданиеНаСборкуКомплектовЧЗ, ЗаданиеНаСборку, "Ошибка закрытия накладной. " + ОписаниеОшибки());
	//		КонецПопытки;			
	//	КонецЕсли;
	//КонецЦикла;	 
	Документы.ЗаданиеНабора.КонтрольНачалаИЗавершенияКомплектацииНаборовЧЗЗНБПакетно(ЗаданиеНаСборку);
	// Кухарь А.Ю.  26.02.2026 конец
	
КонецФункции //ЗавершитьЗадание(ЗаданиеНаСборку) Экспорт

Функция ПолучитьНеобходимыеКомплектующие(тПродукция) Экспорт
	Запрос 		 = Новый ("Запрос");
	Запрос.Текст = "
	|ВЫБРАТЬ * ПОМЕСТИТЬ ВТ_Товары ИЗ &тПродукция КАК тПродукция
	|;
	|ВЫБРАТЬ
	|	ВТ_Товары.Номенклатура		КАК Продукция,
	|	Комплектующие.Номенклатура	КАК Номенклатура,
	|	Комплектующие.Количество
	|		*ВТ_Товары.Количество 	
	|		*ВТ_Товары.Коэффициент	КАК Количество,
	|	Комплектующие.Единица		КАК Единица,
	//Валетов + 09,12,2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-8085 
	//|	Комплектующие.Коэффициент	КАК Коэффициент 
	|	1 КАК Коэффициент   
	//Валетов-
	|ИЗ
	|	Справочник.Номенклатура.Коплектующие КАК Комплектующие
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	ВТ_Товары	
	|ПО
	|	ВТ_Товары.Номенклатура = Комплектующие.Ссылка
	// Кухарь А.Ю.  21.03.2025 начало
	// Пустая задача
	|ГДЕ
	|	Комплектующие.Номенклатура.Родитель.ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидыНоменклаутры.Товар)
	// Кухарь А.Ю.  21.03.2025 конец	
	|УПОРЯДОЧИТЬ ПО
	|	Комплектующие.Номенклатура
	|";		
	
	Запрос.УстановитьПараметр("тПродукция", тПродукция);
	
	Возврат Запрос.Выполнить().Выгрузить();		
КонецФункции //ПолучитьНеобходимыеКомплектующие()

Функция НайтиСоздатьЗаданиеНаСборку(ДокОснование) Экспорт
	Результат = МаркировкаКС.СтруктураРезультата();
	
	Если ЗначениеЗаполнено(ДокОснование) Тогда
		ТипОснования = ТипЗнч(ДокОснование); 
		Если Метаданные.Документы.ЗаданиеНаСборкуКомплектовЧЗ.Реквизиты.ДокОснование.Тип.СодержитТип(ТипОснования) Тогда
			ТребуетсяМаркировка = Истина;
			
			Если ЕстьРеквизитДокумента("ТребуетсяМаркировка", Метаданные.НайтиПоТипу(ТипОснования)) Тогда
				ТребуетсяМаркировка = ПолучитьРеквизитШапки(ДокОснование, "ТребуетсяМаркировка"); 			
			КонецЕсли; 
			
			Если ТребуетсяМаркировка Тогда
				Задание = ЗСБЧЗПоОснованию(ДокОснование);
				Если ЗначениеЗаполнено(Задание) Тогда
					Результат.Данные = Задание;
				Иначе
					// Кельманов А.В. - HELP-5168 - 2025.06.03 {
					//ДокОбъект = Документы.ЗаданиеНаСборкуКомплектовЧЗ.СоздатьДокумент();
					//ДокОбъект.Заполнить(ДокОснование);			
					//
					//Попытка			
					//	ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);			
					//	Результат.Данные = ДокОбъект.Ссылка;
					//Исключение
					//	Результат.Ошибки.Добавить("Не удалось провести задание ! " + ОписаниеОшибки());			
					//КонецПопытки;
					СтруктураОтвета = НайтиСоздатьДокНаРезервированиеКомплектовПодОтгрузку(ДокОснование);
					
					Если СтруктураОтвета.Успех Тогда
						Результат.Данные = СтруктураОтвета.Ссылка;
					Иначе
						Результат.Ошибки.Добавить(СтруктураОтвета.Ошибки);
					КонецЕсли;
					// Кельманов А.В. - HELP-5168 - 2025.06.03 }
				КонецЕсли;
			Иначе
				Результат.Ошибки.Добавить("По выбранному документу маркировка не требуется !");
			КонецЕсли;
		Иначе	
			Результат.Ошибки.Добавить(СтрШаблон("Не допустимый тип основания для ЗСБ: '%1' !", ТипОснования));
		КонецЕсли;		
	Иначе
		Результат.Ошибки.Добавить("Не указано основание для ЗСБ !");
	КонецЕсли;
	
	Результат.Успешно = (Результат.Ошибки.Количество() = 0);
	
	Возврат Результат;	
КонецФункции //НайтиСоздатьЗадание(ДокОснование)
 

// Кельманов А.В. - MARK-766 - 2025.01.28
Функция ЗСБЧЗПоОснованию(Основание) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗаданиеНаСборкуКомплектовЧЗ.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.ЗаданиеНаСборкуКомплектовЧЗ КАК ЗаданиеНаСборкуКомплектовЧЗ
	               |ГДЕ
	               |	ЗаданиеНаСборкуКомплектовЧЗ.Проведен
	               |	И ЗаданиеНаСборкуКомплектовЧЗ.ДокОснование = &ДокОснование";
	
	Запрос.УстановитьПараметр("ДокОснование", Основание);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Возврат Выборка.Ссылка;
		
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

// Кельманов А.В. - MARK-766 - 2025.01.30
Функция ПроверитьЗСБЧЗ(ЗСБЧЗ, Основание) Экспорт
	
	ТекстОшибки = "";
	
	Если ЗСБЧЗ = Неопределено Тогда
		
		ЗСБЧЗ = Документы.ЗаданиеНаСборкуКомплектовЧЗ.ПустаяСсылка();
		
	КонецЕсли;
	
	ТаблицаПереопределяемыхДат = МаркировкаКС.ПодготовитьТаблицуСПереопределяемойДатойНачалаРаботыСМаркировкой(Основание, "Товары");	
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТЗ.Номенклатура КАК Номенклатура,
	               |	ТЗ.ДатаНачалаРаботыСМаркировкой КАК ДатаНачалаРаботыСМаркировкой
	               |ПОМЕСТИТЬ ТЗ_ДатМаркировки
	               |ИЗ
	               |	&ТаблицаПереопределяемыхДат КАК ТЗ
	               |ГДЕ
	               |	ТЗ.ДатаНачалаРаботыСМаркировкой <= &ДатаПроверки
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	РасходнаяНакладнаяТовары.Номенклатура КАК Номенклатура,
	               |	РасходнаяНакладнаяТовары.Количество КАК Количество
	               |ПОМЕСТИТЬ ТЧ_Накладной
	               |ИЗ
	               |	Документ.РасходнаяНакладная.Товары КАК РасходнаяНакладнаяТовары
	               |ГДЕ
	               |	РасходнаяНакладнаяТовары.Ссылка = &Основание
	               |	И РасходнаяНакладнаяТовары.Номенклатура.Родитель.ВидКомплекта = &Комплект
	               |	И РасходнаяНакладнаяТовары.Количество > 0
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТЧ_Накладной.Номенклатура КАК Номенклатура,
	               |	СУММА(ТЧ_Накладной.Количество) КАК Количество
	               |ПОМЕСТИТЬ ВТ_ТребуютсяКодыЧЗ
	               |ИЗ
	               |	ТЗ_ДатМаркировки КАК ТЗ_ДатМаркировки
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТЧ_Накладной КАК ТЧ_Накладной
	               |		ПО ТЗ_ДатМаркировки.Номенклатура = ТЧ_Накладной.Номенклатура
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТЧ_Накладной.Номенклатура
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЗаданиеНаСборкуКомплектовЧЗШтрихкодыУпаковок.ШтрихкодУпаковки.Владелец КАК ШтрихкодУпаковкиВладелец,
	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЗаданиеНаСборкуКомплектовЧЗШтрихкодыУпаковок.ШтрихкодУпаковки) КАК КоличествоКодовВЗСБ
	               |ПОМЕСТИТЬ ВТ_КодыЗСБ
	               |ИЗ
	               |	Документ.ЗаданиеНаСборкуКомплектовЧЗ.ШтрихкодыУпаковок КАК ЗаданиеНаСборкуКомплектовЧЗШтрихкодыУпаковок
	               |ГДЕ
	               |	ЗаданиеНаСборкуКомплектовЧЗШтрихкодыУпаковок.Ссылка = &ЗСБЧЗ
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЗаданиеНаСборкуКомплектовЧЗШтрихкодыУпаковок.ШтрихкодУпаковки.Владелец
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ТребуютсяКодыЧЗ.Номенклатура КАК Номенклатура,
	               |	ВТ_ТребуютсяКодыЧЗ.Количество КАК Количество,
	               |	ЕСТЬNULL(ВТ_КодыЗСБ.КоличествоКодовВЗСБ, 0) КАК КоличествоКодовВЗСБ
	               |ИЗ
	               |	ВТ_ТребуютсяКодыЧЗ КАК ВТ_ТребуютсяКодыЧЗ
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КодыЗСБ КАК ВТ_КодыЗСБ
	               |		ПО ВТ_ТребуютсяКодыЧЗ.Номенклатура = ВТ_КодыЗСБ.ШтрихкодУпаковкиВладелец
	               |ГДЕ
	               |	ВТ_ТребуютсяКодыЧЗ.Количество > ЕСТЬNULL(ВТ_КодыЗСБ.КоличествоКодовВЗСБ, 0)";
	
	Запрос.УстановитьПараметр("ТаблицаПереопределяемыхДат", ТаблицаПереопределяемыхДат);
	Запрос.УстановитьПараметр("Комплект", Перечисления.ВидыКомплектов.Комплект);
	Запрос.УстановитьПараметр("Основание", Основание);
	Запрос.УстановитьПараметр("ЗСБЧЗ", ЗСБЧЗ);
	Запрос.УстановитьПараметр("ДатаПроверки", ПолучитьРеквизитШапки(Основание, "ДатаОтгрузки", "Документ"));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ТекстОшибки = ТекстОшибки + СтрШаблон("Для спайки %1 в ЗСБ недостаточно кодов. Необходимо - %2, в ЗСБ - %3",
		Выборка.Номенклатура, Выборка.Количество, Выборка.КоличествоКодовВЗСБ) + Символы.ПС;
		
	КонецЦикла;
	
	Возврат ТекстОшибки;
	
КонецФункции



// Кухарь А.Ю.  01.04.2025 начало
Функция ЗавершитьВФоне(Знач ЗСБСсылка, ДопПараметры = Неопределено, АдресВозврата = Неопределено) Экспорт
	ЗавершитьЗадание(ЗСБСсылка);	
КонецФункции 
 
Функция ЗарезервироватьКМ(ЗСБ_Ссылка) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Номенклатура				КАК Номенклатура,	
	|	СУММА(ТребутсяКМ)			КАК ТребутсяКМ,
	|	СУММА(ЗарезервированоКМ)	КАК ЗарезервированоКМ
	|ИЗ
	|(
	|ВЫБРАТЬ
	|	Номенклатура							КАК Номенклатура,	
	|	0										КАК ТребутсяКМ,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ШтрихКодУпаковки)	КАК ЗарезервированоКМ
	|ИЗ
	|	РегистрСведений.РезервыКМ	
	|ГДЕ
	|	Регистратор = &ЗСБ_Ссылка
	|СГРУППИРОВАТЬ ПО
	|	Номенклатура
	|ОБЪЕДИНИТЬ ВСЕ
	|ВЫБРАТЬ
	|	Номенклатура,
	|	Количество	КАК ТребутсяКМ,
	|	0			КАК ЗарезервированоКМ
	|ИЗ
	|	Документ.ЗаданиеНаСборкуКомплектовЧЗ.Товары
	|ГДЕ
	|	Ссылка = &ЗСБ_Ссылка
	|ОБЪЕДИНИТЬ ВСЕ
	|ВЫБРАТЬ
	|	Номенклатура,
	|	Количество	КАК ТребутсяКМ,
	|	0			КАК ЗарезервированоКМ
	|ИЗ
	|	Документ.ЗаданиеНаСборкуКомплектовЧЗ.Комплектующие
	|ГДЕ
	|	Ссылка = &ЗСБ_Ссылка
	|	И НЕ Ссылка.ИспользоватьМаркированыеКомплектующие
	|) КАК Сводный
	|СГРУППИРОВАТЬ ПО
	|	Номенклатура
	|";
		
	Запрос.УстановитьПараметр("ЗСБ_Ссылка", ЗСБ_Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Количество = Выборка.ТребутсяКМ - Выборка.ЗарезервированоКМ;
		Если Количество > 0 Тогда
			рБронирования = Справочники.ШтрихкодыУпаковокТоваров.ПолучитьЗабронироватьСвободныеКодыШтук(Выборка.Номенклатура, ЗСБ_Ссылка, Новый Структура("Количество", Количество));					
			Если рБронирования.Успешно Тогда
			Иначе
				МаркировкаКС.ВывестиОшибки(рБронирования);			
			КонецЕсли; 
		КонецЕсли;
	КонецЦикла;	
КонецФункции //ЗарезервироватьКМ(ЗСБ_Ссылка) Экспорт
// Кухарь А.Ю.  01.04.2025 конец
//++Данилова Е.В. 18.08.2025 MARK-1756 
Функция СоздатьРазагрегациюГотовыхНаборов(Знач ЗСБ) Экспорт
	 
	 Результат = МаркировкаКС.СтруктураРезультата();
	 
	 Запрос = Новый Запрос;
	 Запрос.Текст = 
	 "ВЫБРАТЬ РАЗЛИЧНЫЕ
	 //|	ВложенныеШтрихкодыШК.Штрихкод КАК ШтрихкодУпаковки,
	 |	ЛистСборкиКомплектовЧЗШтрихкодыУпаковок.ШтрихкодУпаковки КАК ШтрихкодУпаковки
	 |ИЗ
	 |	Документ.ЛистСборкиКомплектовЧЗ.ШтрихкодыУпаковок КАК ЛистСборкиКомплектовЧЗШтрихкодыУпаковок
	 |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	 |		ПО (СпрНоменклатура.Ссылка = ЛистСборкиКомплектовЧЗШтрихкодыУпаковок.ШтрихкодУпаковки.Владелец)
	 |			И (СпрНоменклатура.Родитель.ВидКомплекта = ЗНАЧЕНИЕ(Перечисление.ВидыКомплектов.ГотовыйКомплект))
	 |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ВложенныеШтрихкодыШК
	 |		ПО (ВложенныеШтрихкодыШК.Ссылка = ЛистСборкиКомплектовЧЗШтрихкодыУпаковок.ШтрихкодУпаковки)
	 |ГДЕ
	 |	ЛистСборкиКомплектовЧЗШтрихкодыУпаковок.Ссылка.ДокОснование = &ЗаданиеНаСборку
	 |	И ЛистСборкиКомплектовЧЗШтрихкодыУпаковок.Ссылка.Завершен
	 |	И ЛистСборкиКомплектовЧЗШтрихкодыУпаковок.Ссылка.Проведен
	 |	И ЛистСборкиКомплектовЧЗШтрихкодыУпаковок.ШтрихкодУпаковки <> ЗНАЧЕНИЕ(Справочник.ШтрихкодыУпаковокТоваров.ПустаяСсылка)";
	 
	 Запрос.УстановитьПараметр("ЗаданиеНаСборку", ЗСБ);
	 
	 РезультатЗапроса = Запрос.Выполнить();
	 
	 Если НЕ РезультатЗапроса.Пустой() Тогда
		 
		 ШКДляМаркировкиТоваров = РезультатЗапроса.Выгрузить(); 
		 
		 Запрос = Новый Запрос;
		 Запрос.Текст = 
		 "ВЫБРАТЬ
		 |	МаркировкаТоваровИСМПШтрихкодыУпаковок.Ссылка КАК Ссылка
		 |ИЗ
		 |	Документ.МаркировкаТоваровИСМП.ШтрихкодыУпаковок КАК МаркировкаТоваровИСМПШтрихкодыУпаковок
		 |ГДЕ
		 |	МаркировкаТоваровИСМПШтрихкодыУпаковок.Ссылка.ДокументОснование = &ЗаданиеНаСборку
		 |	И МаркировкаТоваровИСМПШтрихкодыУпаковок.Ссылка.Проведен
		 |	И МаркировкаТоваровИСМПШтрихкодыУпаковок.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийМаркировки.РасформированиеУпаковки)
		 |
		 |СГРУППИРОВАТЬ ПО
		 |	МаркировкаТоваровИСМПШтрихкодыУпаковок.Ссылка";
		 
		 Запрос.УстановитьПараметр("ЗаданиеНаСборку", ЗСБ);
		 
		 Выборка = Запрос.Выполнить().Выбрать(); 
		 
		 Если Выборка.Следующий() Тогда
			 
			 рШапки		= ПолучитьРеквизитыШапки(Выборка.ссылка, "Статус"); 
			 
			 Если рШапки.Статус = Перечисления.СтатусыДокументовМаркировки.ВРаботе Тогда 			
				 ДокМаркировкиОбъект = Выборка.ссылка.ПолучитьОбъект();
				 ДокМаркировкиОбъект.Товары.Очистить();
				 ДокМаркировкиОбъект.ШтрихкодыУпаковок.Очистить(); 
			 Иначе
				 
				 ТекстОшибки = СтрШаблон("Недопустимый статус документа: '%1' !", рШапки.Статус);
				 Результат.Ошибки.Добавить(ТекстОшибки);
				 Результат.Успешно = Ложь; 
				 
				 Возврат Результат; 
			 КонецЕсли;
		 Иначе 
			 ДокМаркировкиОбъект = Документы.МаркировкаТоваровИСМП.СоздатьДокумент(); 
		 КонецЕсли;
		 
		 ДокМаркировкиОбъект.Дата	= ТекущаяДатаСеанса(); 			
		 
		 ДокМаркировкиОбъект.Организация	= ЗСБ.Организация;
		 
		 Если ДокМаркировкиОбъект.Организация = Маркировка_ПИ.ОрганизацияБТК() Тогда
			 ДокМаркировкиОбъект.Организация = Маркировка_ПИ.ОрганизацияЕЕЭ();	
		 КонецЕсли;
		 ДокМаркировкиОбъект.ДополнительныеСвойства.Вставить("ЗаполнятьТолькоШапку", Истина);
		 ДокМаркировкиОбъект.Заполнить(ЗСБ);
		 ДокМаркировкиОбъект.ДокументОснование = ЗСБ;
		 ДокМаркировкиОбъект.ПодразделениеНанесения = ЗСБ.Докоснование.Склад.Подразделение;
		 
		 
		 ДокМаркировкиОбъект.ВидОперации		= Перечисления.ВидыОперацийМаркировки.РасформированиеУпаковки;
		 ДокМаркировкиОбъект.ВидОперацииИСМП = Перечисления.ВидыОперацийИСМП.РасформированиеУпаковки;
		 ДокМаркировкиОбъект.Статус			= Перечисления.СтатусыДокументовМаркировки.КОбработке;
		 
		 ДокМаркировкиОбъект.ШтрихкодыУпаковок.Загрузить(ШКДляМаркировкиТоваров); 
		 
		 Попытка
			 ДокМаркировкиОбъект.Записать(РежимЗаписиДокумента.Проведение);
			 Результат.Данные = ДокМаркировкиОбъект.Ссылка;
			 Результат.ОбработаноОбъектов = 1;
		 Исключение
			 
			 ТекстОшибки = "Ошибка проведения документа разагрегации!!! Описание ошибки: " +ОписаниеОшибки(); 
			 Результат.Ошибки.Добавить(ТекстОшибки);
		   
		 КонецПопытки;
		 
	 КонецЕсли;
	 
	 Результат.Успешно = (Результат.Ошибки.Количество() = 0); 
	 
	 Возврат Результат;
КонецФункции 

//--Данилова Е.В. 18.08.2025
